app/Controllers/NotesController.php

    public function index()
    {
        $data = [
            'message' => 'success',
            'data_notes' => $this->model->orderBy('id', 'DESC')->findALl()
---
SELECT *
FROM `notes`
ORDER BY `id` DESC